package repl

import (
	"bufio"
	"fmt"
	"io"

	"github.com/Sa2Knight/maron/evaluator"
	"github.com/Sa2Knight/maron/lexer"
	"github.com/Sa2Knight/maron/parser"
)

// PROMPT REPLに毎行表示する文字列
const PROMPT = ">> "

//MARON マスコット
const MARON = `
                                                                                    ..dbbpbka,
                                                                                   .4bbVY"TWbbW,
                                                                                      !     .Wbb[
                                                                                             (bbR
                                                                                            .Xbpf
                                ...(+>>;>>>>>><_-...                                   ...(dbbpY
                           ..(;>;>>>>;>;>>;>;>>;>>;;>><..                          .+WbpppbWUY!
                       ..<>;;>;;;;>;;>;;;;>;;;;;;;>;;;>>>><.                      .bbpY^
                     .>>>;>;;>;>>;;>;>;>>;>;>>;>>;>>;;;;>;;>><.                   _TU!
                  .(>>;;>;;>>;;>;>;>;;>;;>;>;>;>;>;;>>;>;;;;;>>;-              ...
                .(;;;>;>;>;;>;>;;>;;>;>;>;>;;;>;;>;;>;>;>>>;>;;>>;-           Jpbbb
               .;;>;>;>;;<<<<<<<;>>;>;;>;>;>>;>;>;>;<<<<<<<;>;;>;>><.         .4WU^
             .<;;>;<!              !<>;>;;>;;>;<!             ~<;;>;><
            .>;;>!                    (>>;;><                    _<;;;<.
           .;;>!                        (;<                        _<>>>.
          .>>;!                                                      (;;<.
         .>;<                                                         (>><
         <;>!          .(((((-(-.                  .((((((--.          <;>_
        .>;<     .JwVTT777777777TT0X&,        .zXVTT77777777TTTXA+.    .;>;.
        <>;<.-.Jd0^   ~~   d###p_~_ (Xi......dC  ~~   .M##N,~~   jX&,   >>>_
        >><;;:<TX0    :_  .M##H#-~_  dV7   ?7Z}  ~:   d####t:~   .Z0C   >;;<
       .><;:;:;<(u,   ~:.  .7"=.~~   u:      z%  _~~   ?""!_~~   (I    .>;>>
     ..(:;:;;;;;_?k.   _~~_...~~~   JC       .X,   ~:_..._~~    .0     (;>;;
   (;;:;:;;:;:;:_ (4G.... _~~~_...(X= .........TG-..._~~~  ....w=     .;;>;;
 .;;::;;:;:;;:;:_    _?7777777777!    TMNNMMM^   _??777777777?       .;>;>>;
 ;;:;;:;:;;:;:;:.                      TMNMM'                       .;;>;;><
 ::;:;:;:;:;;:;<<.                      ?NM!                      .>;;>;>;;!
 <;:;:;;:;;:;;<>;;<-.                    ?                     .(>>;>;>;>>;
  (;:;:;:;:;;<>;;>;>>><-...................................-(>>>;;>;;>;;;;!
    ~<:;:<<<>;;>;>;;;;>;;;>;;;>;>;>;;>;;;;;;>>>>>>>>>>>>;;;;;;>;;>;>;>;>><
           ;;>;>;;>>;>;>;;>;;>;;;>;;>;;>;>;;;;;;>;>;>;>;;>;>;>;;>;>;>;>;<
            ;;>;>;>;>;>;>>;>>;>>;>;>;>>;>;>>;>;>;;;>;;;>>;>;>;>>;>;;>;;<
             <>;;>;;>;;>;;>;;>;;>;>;;;>;;>;;>;>;>>;>;>;;>;;>;;;>;;>;;><
              <;>;>;;>;>;;>;;>;>;;>;>;;>;>;>;>;;>;>;>;>;;>;>;>;;>;>>;!
               -<>;>>;>;>>;>;;>;>;;>;>>;>;>;>;>;;>;;>;>>;>;;>;>>;;;<
                 _<;;>;;>;;>>;>;>>;>;;>;;>;;>;>>;>;>;;;>;;>;>;;>;<
                   _<>;>;;>;;>;;;>;;>;;>;>;>;;;>;;>;>>;;>>;>;>;<
                      <;>;>;>;>>;;>>;>>;>;>;>>;;>;>;;>>;>;;><!
                        _&<>;;>;>;>;;>;;>;;>;;>>;>;>;;>;>+/
                         kkHc!<;;>;;>;;>;>;>;;>;;>;><<!dWkr
                         Y^        ~!<<<<<<<<<!!~       .7\
`

// Start REPLを開始する
func Start(in io.Reader, out io.Writer) {
	scanner := bufio.NewScanner(in)
	for {
		fmt.Printf(PROMPT)
		scanned := scanner.Scan()
		if !scanned {
			return
		}

		line := scanner.Text()
		l := lexer.New(line)
		p := parser.New(l)

		program := p.ParseProgram()
		if len(p.Errors()) != 0 {
			printParseErrors(out, p.Errors())
			continue
		}

		evaluated := evaluator.Eval(program)
		if evaluated != nil {
			io.WriteString(out, evaluated.Inspect())
			io.WriteString(out, "\n")
		}
	}
}

func printParseErrors(out io.Writer, errors []string) {
	fmt.Println(MARON)
	for _, msg := range errors {
		io.WriteString(out, "\t"+msg+"\n")
	}
}
